# Create IMDB tables in PostgreSQL
This notebook shows the steps for creating PostgreSQL table from official IMDB datasets: https://datasets.imdbws.com/.  The explanation of the columns can eb found at: https://www.imdb.com/interfaces/.

## Data preprocessing (optional)
The raw values in the datasets can contain special values such as `'\N'`.  Those values can be regarded as `NULL` while being loaded into PostgreSQL.  However, some of the cells are empty and represent `NULL` by default. To avoid confusion, we can use Python and Pandas to preprocess the data.

In addition, some columns have `ARRAY` data type.  Cells in these columns need to be wrapped with `'{'` and `'}'` for PostgreSQL to parse as arrays.

In [1]:
import pandas as pd

In [2]:
names = pd.read_csv('/home/franklu/MDS/datasets/imdb/name.basics.tsv', 
            sep = '\t', header = 0)
names.head(3)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,\N,\N,"soundtrack,actor,miscellaneous","tt0053137,tt0050419,tt0072308,tt0043044"
1,nm0000002,Lauren Bacall,\N,\N,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0071877"
2,nm0000003,Brigitte Bardot,\N,\N,"actress,soundtrack,music_department","tt0054452,tt0059956,tt0049189,tt0057345"

In [3]:
names.query('primaryName == "Brad Pitt"')

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
92,nm0000093,Brad Pitt,\N,\N,"actor,producer,soundtrack","tt2935510,tt0114746,tt0356910,tt1210166"

In [4]:
def wrap_arr(names):
    # make NULL consistent as '\N'
    if pd.isna(names) or names.upper() == '\\N':
        return '\\N'
    # if not NULL, wrap cell with '{' & '}'
    else:
        res = '{'
        for pro in names.split(','):
            res = res + '"' + pro + '",'
        return res[:-1] + '}'

In [5]:
names['primaryProfession'] = names['primaryProfession'].apply(wrap_arr)
names['knownForTitles'] = names['knownForTitles'].apply(wrap_arr)

In [6]:
names[names['nconst'] == 'nm0041636']

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
39881,nm0041636,Audrey,\N,\N,\N,"{""tt0259131""}"

In [7]:
names[names['primaryName'] == 'James McIngvale']

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
539824,nm0570566,James McIngvale,\N,\N,"{""producer""}","{""tt0185065"",""tt0072506"",""tt0185103"",""tt0105402""}"
994200,nm10072524,James McIngvale,\N,\N,"{""actor""}","{""tt0105402""}"
3185301,nm1792450,James McIngvale,\N,\N,\N,\N

## Load IMDB datasets into PostgreSQL
Below we will load 2 of the IMDB datasets, name.basics.tsv and title.basics.tsv, into PostgreSQL.  Because I start from a fresh PostgreSQL installation, a user has to be created first.

#### Create user (which includes *LOGIN* by default) with *SUPERUSER* privilege

```sql
CREATE USER [username] SUPERUSER
ALTER USER [username] WITH PASSWORD ['password']
```

### Load name.basics.tsv into PostgreSQL as name_basics
- __create a table with proper data types__
```sql
CREATE TABLE name_basics (
    nconst text PRIMARY KEY,
    primary_name text,
    birth_year int,
    death_year int,
    primary_profession text,
    known_for text
);
```

- __load raw name.basics.tsv into PostgreSQL__
```sql
COPY name_basics 
FROM '/home/franklu/MDS/datasets/imdb/name.basics.tsv' 
    WITH (
        FORMAT csv,
        DELIMITER E'\t',
        NULL '\N',
        HEADER
    );
```

- __convert comma-separated strings into arrays and make years as dates__
```sql
ALTER TABLE name_basics
    ALTER COLUMN primary_profession TYPE text ARRAY 
        USING string_to_array(primary_profession, ','),
    ALTER COLUMN known_for TYPE text ARRAY 
        USING string_to_array(known_for, ','),
    ALTER COLUMN start_year TYPE date
        USING to_date(start_year::text, 'YYYY'),
    ALTER COLUMN end_year TYPE date
        USING to_date(end_year::text, 'YYYY');
ALTER TABLE name_basics
    RENAME primary_name TO name;
```

### Load title.basics.tsv as title_basics
- __create table__
```sql
CREATE TABLE title_basics (
    tconst text,
    title_type text,
    primary_title text, point of release
    original_title text,
    is_adult int,
    start_year int,
    end_year int,
    runtime_minutes int,
    genres text
);
```

- __load tsv into PostgreSQL__
```sql
COPY title_basics 
FROM '/home/franklu/MDS/datasets/imdb/title.basics.tsv'
    WITH (
        FORMAT csv,
        DELIMITER E'\t',
        NULL '\N',
        HEADER
    );
```

- __convert int into date types__
```sql
ALTER TABLE title_basics ADD PRIMARY KEY (tconst);
ALTER TABLE title_basics
    ALTER COLUMN start_year TYPE date
        USING to_date(start_year::text, 'YYYY'),
    ALTER COLUMN end_year TYPE date
        USING to_date(end_year::text, 'YYYY'),
    ALTER is_adult TYPE bool
        USING 
            CASE 
                WHEN is_adult=0 THEN FALSE 
                ELSE TRUE 
            END;      
ALTER TABLE title_basics
    DROP COLUMN genres;
```

### Load title.ratings.tsv into PostgreSQL

- create table  
```sql
CREATE TABLE title_ratings (
    tconst text PRIMARY KEY,
    average_rating real,
    num_votes int
);
```

- __load raw title.ratings.tsv into PostgreSQL__
```sql
COPY name_basics 
FROM '/home/franklu/MDS/datasets/imdb/title.ratings.tsv' 
    WITH (
        FORMAT csv,
        DELIMITER E'\t',
        NULL '\N',
        HEADER
    );
```

### Some useful queries

In [8]:
import os
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

def execute_print_query(sql_statement):
    query = engine.execute(sql_statement)
    return pd.DataFrame(query.fetchall(), columns=query.keys())

engine_setup = f"postgres://franklu:{os.getenv('PSQL_PSWD')}@localhost:5432/franklu"
engine = create_engine(engine_setup, pool_size = 3)

> __use `~` for regex match, `~*` for case-insensitive__

In [9]:
query = '''
SELECT * FROM name_basics WHERE name ~* 'brad pitt\w*$';
'''
brad = execute_print_query(query)
brad

,nconst,name,birth_year,death_year,primary_profession,known_for
0,nm0000093,Brad Pitt,None,None,"[actor, producer, soundtrack]","[tt2935510, tt0114746, tt0356910, tt1210166]"
1,nm10981109,Brad Pitts,None,None,"[camera_department, composer]",None
2,nm6221785,Brad Pittance,None,None,[actor],[tt3183258]

> __use regexp_replace to customize the projection__

In [10]:
query = '''
SELECT 
    name, 
    regexp_replace(name, '(Bra)\w+ (Pit)\w+$', 'XX\\1XX YY\\2YY', 'g') AS funny, 
    substring(name from 'Brad Pitt(.+)') AS extra
FROM name_basics WHERE name ~* 'brad pitt';
'''
brad = execute_print_query(query)
brad

                       name                     funny            extra
0                 Brad Pitt           XXBraXX YYPitYY             None
1  Brad Pitt vom Mahdenwald  Brad Pitt vom Mahdenwald   vom Mahdenwald
2                Brad Pitts           XXBraXX YYPitYY                s
3             Brad Pittance           XXBraXX YYPitYY             ance

> __use `COALESCE` & `NULLIF` to avoid division by zero__

In [11]:
query = '''
SELECT
    primary_title, 60 / COALESCE(NULLIF(runtime_minutes, 0), 1e-6) AS rep_per_hour FROM title_basics 
WHERE runtime_minutes = 0;
'''
per_hour = execute_print_query(query)
per_hour

                      primary_title           rep_per_hour
0                     Self Portrait  60000000.000000000000
1                   The Last Flight  60000000.000000000000
2                  Concerning $1000  60000000.000000000000
3     Traffic Crossing Leeds Bridge  60000000.000000000000
4  Storm P. tegner de Tree Små Mænd  60000000.000000000000
5                          The Talk  60000000.000000000000
6                               V-r  60000000.000000000000
7             Les nouveaux barbares  60000000.000000000000
8         Rip's Twenty Years' Sleep  60000000.000000000000
9                  Awakening of Rip  60000000.000000000000

> __for each type, count how many titles are longer than 5 minutes__

In [12]:
query = '''
SELECT title_type, COUNT(title_type) AS count 
FROM title_basics
WHERE runtime_minutes >= 5
GROUP BY title_type
HAVING COUNT(title_type) > 10000
ORDER BY count DESC;
'''
agg = execute_print_query(query)
agg

  title_type   count
0      movie  137301
1  tvEpisode  136417
2      short   78464
3      video   41190
4    tvMovie   31179
5   tvSeries   26740

> __given 60 minutes as long, for each type, find the proportion of long titles__

In [13]:
query = '''
SELECT title_type,
    AVG(
        CASE
            WHEN runtime_minutes >= 60 THEN 1
            ELSE 0
        END
    ) AS prop_long
FROM title_basics
WHERE runtime_minutes IS NOT NULL
GROUP BY title_type
ORDER BY prop_long DESC;
'''
prop = execute_print_query(query)
prop

     title_type               prop_long
0         movie  0.90506877544035942358
1     tvSpecial  0.77255302836698185535
2       tvMovie  0.75904193920738745671
3         video  0.69476856152434465415
4  tvMiniSeries  0.66365626710454296661
5     videoGame  0.50000000000000000000
6      tvSeries  0.28373008504475062205
7     tvEpisode  0.19775890746739035280
8       tvShort  0.00052534804307853953
9         short  0.00010414376468137794

> __Find Brad Pitt from title_basics__

In [14]:
query = '''
SELECT TL.tconst, TL.primary_title, NM.name, NM.nconst
FROM name_basics AS NM, title_basics AS TL
WHERE NM.name ~* '^brad pitt$'
    AND TL.tconst = ANY(NM.known_for)
ORDER BY TL.tconst, NM.nconst;
'''
cast = execute_print_query(query)
cast

      tconst     primary_title       name     nconst
0  tt0114746        12 Monkeys  Brad Pitt  nm0000093
1  tt0356910  Mr. & Mrs. Smith  Brad Pitt  nm0000093

> __List names born after 1963 and known for "movie" or "tvEpisode"__
- use `= ANY` for matching elements in arrays
- use `IN` for matching elements in sets

In [15]:
query = '''
WITH people AS (
	SELECT nconst, name, birth_year, known_for
	FROM name_basics
	WHERE birth_year IS NOT NULL
		AND birth_year > TO_DATE('1963', 'YYYY')
)

SELECT p.nconst, p.name, p.birth_year, t.primary_title, t.title_type
FROM people AS p, title_basics AS t
WHERE t.title_type IN ('movie', 'tvEpisode')
	AND t.tconst = ANY(p.known_for);
'''
type_name = execute_print_query(query)
type_name

,nconst,name,birth_year,primary_title,title_type
0,nm0000084,Li Gong,1965-01-01,Raise the Red Lantern,movie
1,nm0000084,Li Gong,1965-01-01,Memoirs of a Geisha,movie
2,nm0000084,Li Gong,1965-01-01,Miami Vice,movie
3,nm0000084,Li Gong,1965-01-01,Curse of the Golden Flower,movie
4,nm0000099,Patricia Arquette,1968-01-01,True Romance,movie
...,...,...,...,...,...
37196,nm9772583,Fyodor Roschin,2004-01-01,"Blizhe, chem kazhetsya",movie
37197,nm9813905,Prince Thompson Iyamu,1968-01-01,The Scorpion King,movie
37198,nm9813905,Prince Thompson Iyamu,1968-01-01,I'll Sleep When I'm Dead,movie
37199,nm9968056,Joël Dupont,1990-01-01,Belle du Seigneur,movie
37200,nm9985304,Nikos Papathanasiou,1993-01-01,Lair,movie

> __Add the average runtime of the respective `type` category to each title in `title_basics`__

In [16]:
query = '''
WITH avg_runtime AS (
	SELECT title_type, AVG(runtime_minutes) AS avg_time
	FROM title_basics
	GROUP BY title_type
)

SELECT TL.*, ROUND(AR.avg_time, 3) AS type_avg
FROM title_basics AS TL, avg_runtime AS AR
WHERE TL.title_type = AR.title_type;
'''
cast = execute_print_query(query)
cast[cast['tconst'] == 'tt0073557']

,tconst,title_type,primary_title,original_title,is_adult,start_year,end_year,runtime_minutes,type_avg
1048569,tt0073557,tvMovie,Polly oder Die Bataille am Bluewater Creek,Polly oder Die Bataille am Bluewater Creek,False,1975-01-01,None,NaN,84.438

> __Use window function for the previous problem__

In [17]:
query = '''
SELECT tconst, title_type, primary_title, runtime_minutes,
	ROUND((AVG(runtime_minutes) OVER (PARTITION BY title_type)), 3) as avg_time
FROM title_basics
WHERE title_type NOT IN ('movie', 'short');
'''
cast = execute_print_query(query)
cast[cast['tconst'] == 'tt0073557']

,tconst,title_type,primary_title,runtime_minutes,avg_time
569214,tt0073557,tvMovie,Polly oder Die Bataille am Bluewater Creek,NaN,84.438

> __** collect `nconst` and `birth_year` for people with the same name__

In [18]:
query = '''
CREATE TEMP TABLE IF NOT EXISTS dup_names AS (
	WITH tbl AS (
		SELECT nconst, birth_year, name
		FROM name_basics
		WHERE name IN (
			SELECT name
			FROM name_basics
			GROUP BY name
			HAVING COUNT(nconst) > 1
			)
		ORDER BY name, nconst
		)
	SELECT name, ARRAY_AGG(nconst) AS nconsts, ARRAY_AGG(birth_year) AS births
	FROM tbl
	GROUP BY name
	ORDER BY ARRAY_LENGTH(ARRAY_AGG(nconst), 1) DESC
	);

SELECT name, nconsts
FROM dup_names
WHERE ARRAY_LENGTH(nconsts, 1) = 2;
'''
same_names = execute_print_query(query)
same_names

                              name                   nconsts
0                    Staci Stander    [nm6317298, nm6429797]
1                     Staci Wilson    [nm0934158, nm9048559]
2                     Stacy Abrams    [nm0009244, nm8070419]
3                   Stacy Albright  [nm10584695, nm10593819]
4                      Stacy Baker    [nm1443630, nm8407598]
...                            ...                       ...
376796  Prathamesh Hemant Kulkarni  [nm11149172, nm11152818]
376797                Ramón Rivera    [nm0729395, nm6683774]
376798               Radek Valenta   [nm0884041, nm11562811]
376799                Ramón Rivero    [nm0729494, nm1088576]
376800                   Ramon Roa   [nm10167921, nm7169339]

[376801 rows x 2 columns]

> __Find people with the same name and working in the same movie__

In [19]:
query = '''
CREATE OR REPLACE FUNCTION same_tconst(in text, in text, out tconst text) AS
	$$ 
	SELECT UNNEST(known_for) AS tconst
	FROM name_basics
	WHERE nconst = $1

	INTERSECT

	SELECT UNNEST(known_for) AS tconst
	FROM name_basics
	WHERE nconst = $2
	$$
	LANGUAGE SQL;
    
WITH tbl AS (
	SELECT nconst, birth_year, name
	FROM name_basics
	WHERE name IN (
		SELECT name
		FROM name_basics
		GROUP BY name
		HAVING COUNT(nconst) > 1
		)
	ORDER BY name, nconst
), names_dup AS (
	SELECT name, ARRAY_AGG(nconst) AS nconsts, ARRAY_AGG(birth_year) AS births
	FROM tbl
	GROUP BY name
	ORDER BY ARRAY_LENGTH(ARRAY_AGG(nconst), 1) DESC
), dual AS (
	SELECT name, nconsts, births
	FROM names_dup
	WHERE ARRAY_LENGTH(nconsts, 1) = 2
)

SELECT name, nconsts[1], births[1], nconsts[2], births[2],
    same_tconst(nconsts[1], nconsts[2])
FROM dual
WHERE same_tconst(nconsts[1], nconsts[2]) IS NOT NULL
'''
execute_print_query(query)

,name,nconsts,births,nconsts,births,same_tconst
0,Stacy McPherson,nm5181997,None,nm5240210,None,tt2291352
1,Staffan Bengtsson,nm10942825,None,nm5487512,None,tt10196410
2,Stanislaw Banas,nm0051561,1954-01-01,nm9776976,None,tt0441074
3,Stanislaw Bukowski,nm10251615,None,nm1672748,None,tt6712374
4,Stanley Newton,nm0628595,None,nm2223490,None,tt0828158
...,...,...,...,...,...,...
9921,Ramón de Jesús,nm6434840,None,nm6443289,None,tt3674096
9922,Ramón De Los Santos,nm6121079,None,nm8162567,None,tt5744798
9923,Ramon Mentor,nm1240277,None,nm1649350,None,tt0411529
9924,Ramón Morillo,nm5004303,None,nm6597737,None,tt3655264
9925,Ramón Prada,nm1032070,None,nm6427986,None,tt1077076

> __find yearly count of titles starting after 2020__
- show zero if no title for that year

In [20]:
query = '''
SELECT prd.dates AS years, COUNT(tconst) AS num_titles
FROM (
	SELECT generate_series(MIN(start_year), MAX(start_year), '1 year')::date
	FROM title_basics
) AS prd(dates)
LEFT JOIN title_basics AS tt ON tt.start_year = prd.dates
GROUP BY prd.dates
ORDER BY prd.dates
'''
title_cnt = execute_print_query(query)
title_cnt

          years  num_titles
0    1888-01-01           2
1    1889-01-01           1
2    1890-01-01           3
3    1891-01-01           7
4    1892-01-01           9
..          ...         ...
134  2022-01-01          31
135  2023-01-01           6
136  2024-01-01           3
137  2025-01-01           0
138  2026-01-01           1

[139 rows x 2 columns]

In [21]:
title_cnt.tail(10)

          years  num_titles
129  2017-01-01       10342
130  2018-01-01       15390
131  2019-01-01       49106
132  2020-01-01        2300
133  2021-01-01         143
134  2022-01-01          31
135  2023-01-01           6
136  2024-01-01           3
137  2025-01-01           0
138  2026-01-01           1

> __list temporary tables__

In [22]:
query = '''
CREATE OR REPLACE FUNCTION list_temp_tables(_pattern text = 'pg_temp')
    RETURNS TABLE(
        SchemaName name, 
        RelationName name, 
        RelationType text, 
        RelationOwner name, 
        RelationSize text) AS
    $$ BEGIN
    RETURN query
    SELECT
        n.nspname as SchemaName
        ,c.relname as RelationName
        ,CASE c.relkind
        WHEN 'r' THEN 'table'
        WHEN 'v' THEN 'view'
        WHEN 'i' THEN 'index'
        WHEN 'S' THEN 'sequence'
        WHEN 's' THEN 'special'
        END as RelationType
        ,pg_catalog.pg_get_userbyid(c.relowner) as RelationOwner               
        ,pg_size_pretty(pg_relation_size(n.nspname ||'.'|| c.relname)) as RelationSize
    FROM pg_catalog.pg_class c
    LEFT JOIN pg_catalog.pg_namespace n               
                    ON n.oid = c.relnamespace
    WHERE n.nspname ~* _pattern
    ORDER BY pg_relation_size(n.nspname ||'.'|| c.relname) DESC;
    END $$
    LANGUAGE plpgsql;
    
SELECT * FROM list_temp_tables();
'''
temp_tables = execute_print_query(query)
temp_tables

  schemaname relationname relationtype relationowner relationsize
0  pg_temp_3    dup_names        table       franklu        99 MB

> __find yearly counts of titles for the past 10 years__
- and find the numbers of actors born 1 year after

In [23]:
query = '''
SELECT nb.birth_year, tb.num_titles, COUNT(DISTINCT nconst) AS num_people
FROM (
	SELECT start_year AS year_, COUNT(DISTINCT tconst) AS num_titles
	FROM title_basics
	WHERE DATE_TRUNC('year', NOW() - INTERVAL '10 years')::DATE <= start_year
		AND start_year < DATE_TRUNC('year', CURRENT_DATE)::DATE
	GROUP BY start_year
) AS tb
LEFT JOIN name_basics AS nb
	ON (tb.year_ + interval '1 year')::DATE = nb.birth_year
GROUP BY nb.birth_year, tb.num_titles
ORDER BY nb.birth_year DESC
'''
execute_print_query(query)

   birth_year  num_titles  num_people
0  2020-01-01       49106           1
1  2019-01-01       15390           1
2  2018-01-01       10342           2
3  2017-01-01        8528           2
4  2016-01-01        7559           2
5  2015-01-01        7179           1
6  2014-01-01        7707          10
7  2013-01-01        6026           9
8  2012-01-01        5571          14
9  2011-01-01        5093          14

In [24]:
raise Exception('IMDB exploration stops here')

Exception: IMDB exploration stops here